CSI API ETABS v1
cGroup.GetGroup Method
 Retrieves the group data.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetGroup(
	string Name,
	ref int Color,
	ref bool SpecifiedForSelection,
	ref bool SpecifiedForSectionCutDefinition,
	ref bool SpecifiedForSteelDesign,
	ref bool SpecifiedForConcreteDesign,
	ref bool SpecifiedForAluminumDesign,
	ref bool SpecifiedForColdFormedDesign,
	ref bool SpecifiedForStaticNLActiveStage,
	ref bool SpecifiedForBridgeResponseOutput,
	ref bool SpecifiedForAutoSeismicOutput,
	ref bool SpecifiedForAutoWindOutput,
	ref bool SpecifiedForMassAndWeight
)
Function GetGroup (
	Name As String,
	ByRef Color As Integer,
	ByRef SpecifiedForSelection As Boolean,
	ByRef SpecifiedForSectionCutDefinition As Boolean,
	ByRef SpecifiedForSteelDesign As Boolean,
	ByRef SpecifiedForConcreteDesign As Boolean,
	ByRef SpecifiedForAluminumDesign As Boolean,
	ByRef SpecifiedForColdFormedDesign As Boolean,
	ByRef SpecifiedForStaticNLActiveStage As Boolean,
	ByRef SpecifiedForBridgeResponseOutput As Boolean,
	ByRef SpecifiedForAutoSeismicOutput As Boolean,
	ByRef SpecifiedForAutoWindOutput As Boolean,
	ByRef SpecifiedForMassAndWeight As Boolean
) As Integer
Dim instance As cGroup
Dim Name As String
Dim Color As Integer
Dim SpecifiedForSelection As Boolean
Dim SpecifiedForSectionCutDefinition As Boolean
Dim SpecifiedForSteelDesign As Boolean
Dim SpecifiedForConcreteDesign As Boolean
Dim SpecifiedForAluminumDesign As Boolean
Dim SpecifiedForColdFormedDesign As Boolean
Dim SpecifiedForStaticNLActiveStage As Boolean
Dim SpecifiedForBridgeResponseOutput As Boolean
Dim SpecifiedForAutoSeismicOutput As Boolean
Dim SpecifiedForAutoWindOutput As Boolean
Dim SpecifiedForMassAndWeight As Boolean
Dim returnValue As Integer
returnValue = instance.GetGroup(Name,
	Color, SpecifiedForSelection, SpecifiedForSectionCutDefinition,
	SpecifiedForSteelDesign, SpecifiedForConcreteDesign,
	SpecifiedForAluminumDesign, SpecifiedForColdFormedDesign,
	SpecifiedForStaticNLActiveStage,
	SpecifiedForBridgeResponseOutput,
	SpecifiedForAutoSeismicOutput,
	SpecifiedForAutoWindOutput, SpecifiedForMassAndWeight)
int GetGroup(
	String^ Name,
	int% Color,
	bool% SpecifiedForSelection,
	bool% SpecifiedForSectionCutDefinition,
	bool% SpecifiedForSteelDesign,
	bool% SpecifiedForConcreteDesign,
	bool% SpecifiedForAluminumDesign,
	bool% SpecifiedForColdFormedDesign,
	bool% SpecifiedForStaticNLActiveStage,
	bool% SpecifiedForBridgeResponseOutput,
	bool% SpecifiedForAutoSeismicOutput,
	bool% SpecifiedForAutoWindOutput,
	bool% SpecifiedForMassAndWeight
)
abstract GetGroup :
        Name : string *
        Color : int byref *
        SpecifiedForSelection : bool byref *
        SpecifiedForSectionCutDefinition : bool byref *
        SpecifiedForSteelDesign : bool byref *
        SpecifiedForConcreteDesign : bool byref *
        SpecifiedForAluminumDesign : bool byref *
        SpecifiedForColdFormedDesign : bool byref *
        SpecifiedForStaticNLActiveStage : bool byref *
        SpecifiedForBridgeResponseOutput : bool byref *
        SpecifiedForAutoSeismicOutput : bool byref *
        SpecifiedForAutoWindOutput : bool byref *
        SpecifiedForMassAndWeight : bool byref -> int
Parameters
Name
Type: System.String
This is the name of an existing group.
Color
Type: System.Int32
SpecifiedForSelection
Type: System.Boolean
This item is True if the group is specified to be used for selection; otherwise it is False.
SpecifiedForSectionCutDefinition
Type: System.Boolean
This item is True if the group is specified to be used for defining section cuts; otherwise it is False.
SpecifiedForSteelDesign
Type: System.Boolean
This item is True if the group is specified to be used for defining steel frame design groups; otherwise it is False.
SpecifiedForConcreteDesign
Type: System.Boolean
This item is True if the group is specified to be used for defining concrete frame design groups; otherwise it is False.
SpecifiedForAluminumDesign
Type: System.Boolean
This item is True if the group is specified to be used for defining aluminum frame design groups; otherwise it is False.
SpecifiedForColdFormedDesign
Type: System.Boolean
This item is True if the group is specified to be used for defining cold formed frame design groups; otherwise it is False.
SpecifiedForStaticNLActiveStage
Type: System.Boolean
This item is True if the group is specified to be used for defining stages for nonlinear static analysis; otherwise it is False.
SpecifiedForBridgeResponseOutput
Type: System.Boolean
This item is True if the group is specified to be used for reporting bridge response output; otherwise it is False.
SpecifiedForAutoSeismicOutput
Type: System.Boolean
This item is True if the group is specified to be used for reporting auto seismic loads; otherwise it is False.
SpecifiedForAutoWindOutput
Type: System.Boolean
This item is True if the group is specified to be used for reporting auto wind loads; otherwise it is False.
SpecifiedForMassAndWeight
Type: System.Boolean
This item is True if the group is specified to be used for reporting group masses and weight; otherwise it is False.
Return Value
Type: Int32
Returns zero if the group data is successfully set; otherwise it returns a nonzero value.
Remarks
Items SpecifiedForAluminumDesign, SpecifiedForColdFormedDesignSpecifiedForBridgeResponseOutput are not supported in ETABS.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Color as Integer
       Dim SpecifiedForSelection as Boolean
       Dim SpecifiedForSectionCutDefinition as Boolean
       Dim SpecifiedForSteelDesign as Boolean
       Dim SpecifiedForConcreteDesign as Boolean
       Dim SpecifiedForAluminumDesign as Boolean
       Dim SpecifiedForColdFormedDesign as Boolean
       Dim SpecifiedForStaticNLActiveStage as Boolean
       Dim SpecifiedForBridgeResponseOutput as Boolean
       Dim SpecifiedForAutoSeismicOutput as Boolean
       Dim SpecifiedForAutoWindOutput as Boolean
       Dim SpecifiedForMassAndWeight as Boolean
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'define new group
       ret = SapModel.GroupDef.SetGroup("Group1", -1, True)
   'get group data
       ret = SapModel.GroupDef.GetGroup("Group1", Color, SpecifiedForSelection, SpecifiedForSectionCutDefinition, SpecifiedForSteelDesign, SpecifiedForConcreteDesign, SpecifiedForAluminumDesign, SpecifiedForColdFormedDesign, SpecifiedForStaticNLActiveStage, SpecifiedForBridgeResponseOutput, SpecifiedForAutoSeismicOutput, SpecifiedForAutoWindOutput, SpecifiedForMassAndWeight)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cGroup Interface
ETABSv1 Namespace